# Количество слов

# Дана строка, состоящая из слов, разделенных пробелами. Определите,
# сколько в ней слов.

s = input()
print(s.count(" ") + 1)
